{"class_name": "Sequential", "keras_version": "1.2.2", "config": [{"class_name": "Embedding", "config": {"trainable": true, "name": "embedding_1", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 10000, "batch_input_shape": [20, 20], "W_regularizer": null, "dropout": 0.0, "output_dim": 200, "input_length": null}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "gpu", "stateful": true, "init": "init", "inner_init": "init", "dropout_U": 0.0, "dropout_W": 0.0, "return_sequences": true, "batch_input_shape": [20, 20, 200], "W_regularizer": null, "output_dim": 200, "forget_bias_init": "zero", "b_regularizer": null}}, {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "lstm_2", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "gpu", "stateful": true, "init": "init", "inner_init": "init", "dropout_U": 0.0, "dropout_W": 0.0, "return_sequences": false, "batch_input_shape": [20, 20, 200], "W_regularizer": null, "output_dim": 200, "forget_bias_init": "zero", "b_regularizer": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 200, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 10000}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_1"}}]}